## Titanic Project

In [1]:
import pandas as pd
import numpy as np

In [2]:
def read_data(file) :
    data = pd.read_csv(file)
    return data

In [4]:
trainData = read_data("train.csv")
testData = read_data("test.csv")

In [5]:
trainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
trainDataCp = trainData.copy()

In [26]:
trainDataCpY = trainDataCp["Survived"]

In [27]:
trainDataCpY.unique()

array([0, 1], dtype=int64)

In [28]:
trainDataCpX = trainDataCp.drop(["Survived","Name","Ticket","PassengerId"],axis = 1)

In [29]:
trainDataCpX.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0       3    male  22.0      1      0   7.2500   NaN        S
1       1  female  38.0      1      0  71.2833   C85        C
2       3  female  26.0      0      0   7.9250   NaN        S
3       1  female  35.0      1      0  53.1000  C123        S
4       3    male  35.0      0      0   8.0500   NaN        S

In [30]:
trainDataCpX["Embarked"] = [ 1 if( val == 'S' ) else 0   for val in trainDataCpX["Embarked"] ]

In [31]:
trainDataCpX["Cabin"] = trainDataCpX["Cabin"].fillna("unknow")
trainDataCpX.head()

   Pclass     Sex   Age  SibSp  Parch     Fare   Cabin  Embarked
0       3    male  22.0      1      0   7.2500  unknow         1
1       1  female  38.0      1      0  71.2833     C85         0
2       3  female  26.0      0      0   7.9250  unknow         1
3       1  female  35.0      1      0  53.1000    C123         1
4       3    male  35.0      0      0   8.0500  unknow         1

In [32]:
trainDataCpX["Sex"].unique()

array(['male', 'female'], dtype=object)

In [34]:
Sexdictionary = { 'male':1,'female':0}
trainDataCpX["Sex"] = [ Sexdictionary[x] for x in trainDataCpX["Sex"] ]

In [98]:
trainDataCpX.Age = trainDataCpX.Age.fillna(trainDataCpX.Age.mean())

In [99]:
trainDataCpX.head()

   Pclass  Sex   Age  SibSp  Parch     Fare   Cabin  Embarked
0       3    1  22.0      1      0   7.2500  unknow         1
1       1    0  38.0      1      0  71.2833     C85         0
2       3    0  26.0      0      0   7.9250  unknow         1
3       1    0  35.0      1      0  53.1000    C123         1
4       3    1  35.0      0      0   8.0500  unknow         1

In [44]:
trainDataCpX["Cabin"].unique().size

148

In [80]:
trainDataCp[["Survived","Pclass"]].groupby("Pclass",as_index = False).Survived.mean() # replace mean  with sum

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [67]:
trainDataCp[["Sex","Survived"]].groupby("Sex",as_index = False).Survived.sum()

      Sex  Survived
0  female       233
1    male       109

In [78]:
trainDataCp[["Embarked","Survived"]].groupby("Embarked",as_index = False).Survived.sum()

  Embarked  Survived
0        C        93
1        Q        30
2        S       217

In [84]:
newPclass = pd.DataFrame()
newPclass["Pclass"] = trainDataCp["Pclass"].replace({ 3:2})
newPclass["Survived"] = trainDataCp["Survived"]

In [85]:
newPclass[["Pclass","Survived"]].groupby("Pclass",as_index = False).Survived.mean()

   Pclass  Survived
0       1  0.629630
1       2  0.305185

In [100]:
final_dataX = trainDataCpX.drop(["Fare"],axis = 1)

In [103]:
final_dataX.Cabin = final_dataX.Cabin.astype("category").cat.codes

In [104]:
final_dataX.head(10)

   Pclass  Sex        Age  SibSp  Parch  Cabin  Embarked
0       3    1  22.000000      1      0    147         1
1       1    0  38.000000      1      0     81         0
2       3    0  26.000000      0      0    147         1
3       1    0  35.000000      1      0     55         1
4       3    1  35.000000      0      0    147         1
5       3    1  29.699118      0      0    147         0
6       1    1  54.000000      0      0    129         1
7       3    1   2.000000      3      1    147         1
8       3    0  27.000000      0      2    147         1
9       2    0  14.000000      1      0    147         0

In [107]:
final_dataX = final_dataX.drop(["Cabin"],axis = 1)

In [109]:
final_dataX.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked
0       3    1  22.0      1      0         1
1       1    0  38.0      1      0         0
2       3    0  26.0      0      0         1
3       1    0  35.0      1      0         1
4       3    1  35.0      0      0         1

In [111]:
final_dataX.items()